
def make_allergies_params(user_allergies):
    all_allergies = []

    milk_allergy = (['Молоко', 'Кефир', 'Творог', 'Сметана', 'Айран', 'Бифилин', 'Йогурт',
                        'Катык', 'Кумыс', 'Кефир', 'Масло сливочное',
                        'Сливочное масло',
                        'Маргарин', 'Мороженое', 'Мацони', 'Молочная сыворотка',
                        'Пахта',    'Ряженка', 'Сыр', 'Сливки', 'Сгущёное молоко', 'Сгущёнка', 'Сгущенка',
                        'Спред', 'Шубат', 'Топлёное масло'])

    fish_allergy = (['Рыбий жир', 'Икр', 'Рыба', 'Сардин', 'Тунец', 'Тунца',
                     'Моллюск', 'Устриц', 'Окунь', 'Микижа', 'Креветк', 'Скумбри',
                     'Треск', 'Пикша', 'Палтус', 'Сайр', 'Минта', 'Лосос', 'Нерк',
                     'Акул', 'Сурими', 'Краб', 'Миди', 'Кальмар', 'Чавыч', 'Минта',
                     'Кет', 'Кильк', 'Окун', 'Камбал', 'Хек', 'Сом', 'Форел',
                     'Шпрот', 'Судак', 'Угр', 'Мойв', 'Устрич', 'Дорад', 'Сибас', 'Рыбн', 'Раб'])

    meat_allergy = (['Куриц', 'Курин', 'Мясо', 'Фарш', 'Мясн', 'Говяж', 'Сосиск',
                     'Сардельк', 'Колбас', 'Козье', 'Бекон', 'Крол',
                     'Зай', 'Теляч', 'Телятин', 'Олен', 'Говядина',
                     'Язык', 'Печень', 'Сало', 'Ветчин', 'Буженин', 'Баранин', 'Свинин', 'Индейк'])

    seed_allergy = (['Мука', 'Макарон', 'Спагетти', 'Кукуруз', 'Хлеб', 'Хлоп', 'Горош', 'Сухар', 'Тесто', 'Булг', 'Манн','Камут', 'Рож', 'Ячмен', 'Полб', 'Лаваш', 'Пшенич', 'Пшениц'])

    honey_allergy = (['Мёд', 'Мед'])

    nuts_allergy = (['Орех', 'Миндал', 'Боб', 'Фасол', 'Горох', 'Нут', 'Арахис',
                     'Люпин', 'Фундук', 'Кешью', 'Фисташк', 'Кедр', 'Чечеви'])



    if not user_allergies:
        return ''
    for allergie in user_allergies:
        if allergie == 'Рыба и морепродукты':
             all_allergies += fish_allergy
        if allergie == 'Мясо':
            all_allergies += meat_allergy
        if allergie == 'Зерновые':
            all_allergies += seed_allergy
        if allergie == 'Продукты пчеловодства':
            all_allergies += honey_allergy
        if allergie == 'Орехи и бобовые':
            all_allergies += nuts_allergy
        if allergie == 'Молочные продукты':
            all_allergies += milk_allergy

    return all_allergies


def check_for_allergy(ingredient, allergies):
    fit = True
    for product in allergies:
        if product.lower() in ingredient.lower():
            fit = False
    return fit
